trade/src/InformationRegisters/РетроБонусыКлиентовКонтрагенты/РетроБонусыКлиентовКонтрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РетроБонусыКлиентовКонтрагенты</name>
  <resources>
    <name>СуммаПлан</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>РегистраторДвижения</name>
    <type>
      <types>DocumentRef.УсловияРетроБонусовКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументУсловий</name>
    <type>
      <types>DocumentRef.УсловияРетроБонусовКлиентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/РетроБонусыКлиентовУсловия/РетроБонусыКлиентовУсловия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РетроБонусыКлиентовУсловия</name>
  <resources>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыРетроБонусовКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СоставУчастников</name>
    <type>
      <types>EnumRef.СоставыУчастниковРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>Участники</name>
    <type>
      <types>EnumRef.СоставыСписковРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>СоставТоваров</name>
    <type>
      <types>EnumRef.СоставыТоваровРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>Товары</name>
    <type>
      <types>EnumRef.СоставыСписковРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БонусПроцент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПлан</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьУсловий</name>
    <type>
      <types>EnumRef.ПериодичностиРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьНачислений</name>
    <type>
      <types>EnumRef.ПериодичностиРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>ДетализацияРасчетаУчастников</name>
    <type>
      <types>EnumRef.ДетализацияРасчетаУчастниковРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретНачисленияСверхПлана</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СегментыЗафиксированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ВидШкалыРасчета</name>
    <comment>Для базы по количеству: 0 - прогрессивная шкала, 1 - по диапазонам.  Для базы по сумме: 0 - одно значение, 1 - прогрессивная шкала, 2 - по диапазонам.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РегистраторДвижения</name>
    <type>
      <types>DocumentRef.УсловияРетроБонусовКлиентов</types>
    </type>
  </attributes>
  <dimensions>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументУсловий</name>
    <type>
      <types>DocumentRef.УсловияРетроБонусовКлиентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/Enums/СоставыУчастниковРетроБонусов/СоставыУчастниковРетроБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СоставыУчастниковРетроБонусов</name>
  <enumValues>
    <name>ИНН</name>
  </enumValues>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>Клиенты</name>
  </enumValues>
  <enumValues>
    <name>СегментыПартнеров</name>
  </enumValues>
  <enumValues>
    <name>Договоры</name>
  </enumValues>
  <enumValues>
    <name>Соглашения</name>
  </enumValues>
</mdclass:Enum>

trade/src/InformationRegisters/РетроБонусыКлиентовКонтрагенты/ManagerModule.bsl
//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Описание ограничения доступа
// 
// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЧтениеОбъектаРазрешено(ДокументУсловий)";
	
КонецПроцедуры

#Область ОбновлениеИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
// 	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыСведений.РетроБонусыКлиентовКонтрагенты.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "2.5.21.64";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("f0498a6c-7282-48e9-96be-9df3eff6f782");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.РетроБонусыКлиентовКонтрагенты.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Обычный;
	Обработчик.Комментарий = НСтр("ru = 'Заполнение поля ""Номер строки документа"" в регистре сведений ""Ретро-бонусы клиентов: контрагенты"".
								  |До момента заполнения в печатных формах документа ""Условия ретро-бонусов клиентов"" может меняться порядок строк при повторной печати.'");
	
	Читаемые = Новый Массив; // Массив Из Строка
	Читаемые.Добавить(Метаданные.Документы.УсловияРетроБонусовКлиентов.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыСведений.РетроБонусыКлиентовКонтрагенты.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив; // Массив Из Строка
	Изменяемые.Добавить(Метаданные.РегистрыСведений.РетроБонусыКлиентовКонтрагенты.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
КонецПроцедуры

// Регистрация изменений.
// 
// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрСведений.РетроБонусыКлиентовКонтрагенты";
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = "Документ.УсловияРетроБонусовКлиентов";
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяРегистра;
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиИзмеренияНезависимогоРегистраСведений();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.ДокументУсловий КАК ДокументУсловий
	|ИЗ
	|	РегистрСведений.РетроБонусыКлиентовКонтрагенты КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.НомерСтрокиДокумента = 0";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	РегистрируемыеИзмерения = Запрос.Выполнить().Выгрузить();
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, РегистрируемыеИзмерения, ДополнительныеПараметры);
	
КонецПроцедуры

// Обработчик обновления.
// 
// Параметры:
//  Параметры - Структура - параметры обработчика:
//   * ВерсияПодсистемыНаНачалоОбновления - Строка - версия подсистемы.
//   * ИмяОбработчика - Строка - имя обработчика.
//   * ОбновляемыеДанные - Структура.
//   * ОбработкаЗавершена - Булево, Неопределено - признак завершения обработки.
//   * Очередь - Число - очередь.
//   * ПрогрессВыполнения - Структура:
//     ** ВсегоОбъектов - Число - всего обработано объектов.
//     ** ОбработаноОбъектов - Число - обработано объектов.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	ПолноеИмяОбъекта = Метаданные.РегистрыСведений.РетроБонусыКлиентовКонтрагенты.ПолноеИмя();
	ИмяРегистра = Метаданные.РегистрыСведений.РетроБонусыКлиентовКонтрагенты.Имя;
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляОбработки();
	ДополнительныеПараметры.ИмяВременнойТаблицы = "ДанныеДляОбработки";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Результат = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуИзмеренийНезависимогоРегистраСведенийДляОбработки(
		Параметры.Очередь,
		ПолноеИмяОбъекта,
		МенеджерВременныхТаблиц,
		ДополнительныеПараметры);
	
	Если НЕ Результат.ЕстьДанныеДляОбработки
	 ИЛИ НЕ Результат.ЕстьЗаписиВоВременнойТаблице Тогда
		
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.ДокументУсловий КАК ДокументУсловий,
	|	ДанныеРегистра.РегистраторДвижения КАК РегистраторДвижения,
	|	ЕСТЬNULL(РетроБонусыКлиентовУсловия.СегментыЗафиксированы, ЛОЖЬ) КАК ЗафиксированСоставСегментов
	|ИЗ
	|	РегистрСведений.РетроБонусыКлиентовКонтрагенты КАК ДанныеРегистра
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РетроБонусыКлиентовУсловия КАК РетроБонусыКлиентовУсловия
	|		ПО ДанныеРегистра.ДокументУсловий = РетроБонусыКлиентовУсловия.ДокументУсловий
	|			И (ДанныеРегистра.РегистраторДвижения = РетроБонусыКлиентовУсловия.РегистраторДвижения
	|				И РетроБонусыКлиентовУсловия.СоставУчастников = ЗНАЧЕНИЕ(Перечисление.СоставыУчастниковРетроБонусов.СегментыПартнеров)
	|				И РетроБонусыКлиентовУсловия.СегментыЗафиксированы)
	|ГДЕ
	|	ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				ДанныеДляОбработки КАК ДанныеДляОбработки
	|			ГДЕ
	|				ДанныеДляОбработки.ДокументУсловий = ДанныеРегистра.ДокументУсловий)";
	
	ОбновляемыеДанные = Запрос.Выполнить().Выгрузить();
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	ИсключенияПриОбновлении = Новый Массив;
	
	СписокОписаний = Новый Массив; // Массив Из Строка
	СписокОписаний.Добавить(НСтр("ru = 'Не удалось обработать записи регистра сведений ""Ретро-бонусы клиентов: контрагенты"".'"));
	
	ШаблонВсегоПропущено = НСтр("ru = 'Всего пропущено: %1'");
	ШаблонСообщения = НСтр("ru = 'Обработана порция документов условий по регистру сведений ""Ретро-бонусы клиентов: контрагенты"": %1'");
	
	Для каждого Данные Из ОбновляемыеДанные Цикл
		
		ПричинаИсключения = 0;
			
		НачатьТранзакцию();
		
		Попытка
			
			ПричинаИсключения = 1; // Блокировка
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("ДокументУсловий", Данные.ДокументУсловий);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.РетроБонусыКлиентовКонтрагенты.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ДокументУсловий.Установить(Данные.ДокументУсловий);
			НаборЗаписей.Прочитать();
			
			Если Данные.ЗафиксированСоставСегментов Тогда
				
				Счетчик = 1;
				
				Для каждого Запись Из НаборЗаписей Цикл
				
					Запись.НомерСтрокиДокумента = Счетчик;
					Счетчик = Счетчик + 1;
				
				КонецЦикла;
				
			Иначе
				
				ТаблицаРегистра = Неопределено;
				ТаблицыДляДвижений = Документы.УсловияРетроБонусовКлиентов.ДанныеДокументаДляПроведения(
					Данные.РегистраторДвижения, ИмяРегистра);
				ТаблицыДляДвижений.Свойство("Таблица" + ИмяРегистра, ТаблицаРегистра);
				НаборЗаписей.Загрузить(ТаблицаРегистра);
			
			КонецЕсли;
						
			ПричинаИсключения = 3; // Запись
			
			Если НаборЗаписей.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
			КонецЕсли;
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Данные.ДокументУсловий);
			
			Если ПричинаИсключения = 3 Тогда
				
				ОбновлениеИнформационнойБазыУТ.ЗаписатьПлохиеДанные(
					ИсключенияПриОбновлении, ОбъектовОбработано, Параметры);
				ВызватьИсключение СтрСоединить(СписокОписаний, Символы.ПС);
				
			КонецЕсли;
			
		КонецПопытки;
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
		Параметры.Очередь, ПолноеИмяОбъекта);
	
	Если ОбъектовОбработано = 0
	   И ПроблемныхОбъектов <> 0 Тогда
		
		Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонВсегоПропущено, Строка(ПроблемныхОбъектов));
		
		СписокОписаний.Добавить(Сообщение);
		ТекстСообщения = СтрСоединить(СписокОписаний, Символы.ПС);
		ВызватьИсключение ТекстСообщения;
		
	Иначе
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСообщения,
			Строка(ОбъектовОбработано));
		
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			,
			,
			ТекстСообщения);
		
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыУТ.ЗаписатьПлохиеДанные(ИсключенияПриОбновлении, ОбъектовОбработано, Параметры);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
